$(document).ready(function () {
  // aq typescript unda iyos wesit
  function typeMessage(message, element) {
    new TypeIt(element, {
      strings: [message],
      speed: 50,
      breakLines: false,
      autoStart: true,
    });
  }
  
  // functions

  // Georgian Fight function

  function getHistoricalEventYear(event) {
    const historicalEvents = {
      გარნისის_ბრძოლა: 52,
      რეხის_ბრძოლა: 76,
      პეტრის_ბრძოლა: 542,
      პეტრის_ბრძოლა: 549,
      რიონის_ბრძოლა: 550,
      მუხურისის_ბრძოლა: 550,
      პეტრის_ბრძოლა: 551,
      არქეოპოლისის_ციხეგოჯის_ბრძოლა: 551,
      ტელეფისის_ბრძოლა: 553,
      ფოთის_ფასისის_ბრძოლა: 555,
      ძახარის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 550-628 წლამდე იყო ',
      ტფილისის_ალყა: 628,
      არგვეთის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
      ციხეგოჯის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
      ცხუმის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
      ანაკოფიის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
      რეხის_ბრძოლა: 842,
      ასპინძის_ბრძოლა: 888,
      უფლისციხის_ბრძოლა: 904,
      ყველისციხის_ალყა: 914,
      უფლისციხის_ბრძოლა: 926,
      მოღრისის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 926-1010 წლამდე იყო ',
      შამქორის_ბრძოლა: 1010,
      შირიმნის_ბრძოლა: 1021,
      სვინდაქსის_ბრძოლა: 1022,
      ეკლეცის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1022-1038 წლამდე იყო ',
      ტფილისის_ალყა: 1038,
      სასირეთის_ბრძოლა: 1047,
      არყისციხის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1047-1074 წლამდე იყო ',
      ფარცხისის_ბრძოლა: 1074,
      ყველისციხის_ბრძოლა: 1080,
      ზედაზნის_ციხის_აღება: 1103,
      ერწუხის_ბრძოლა: 1104,
      სამშვილდის_შემოერთება: 1110,
      რუსთავის_შემოერთება: 1115,
      რახსის_ბრძოლა: 1118,
      ბოტორის_ბრძოლა: 1120,
      დიდგორის_ბრძოლა: 1121,
      ტფილისის_შემოერთება: 1122,
      დმანისის_შემოერთება: 1124,
      ანისის_შემოერთება: 1124,
      განჯის_აღება: 1138,
      ანისის_აღება: 1161 + " და " + 1173 + " წლებში ასევე 1199 წელს ",
      დვინის_აღება: 1162,
      შაბურანის_აღება: 1167,
      ნიალის_ბრძოლა: 1191,
      შამქორის_ბრძოლა: 1195,
      ბასიანის_ბრძოლა: 1203,
      ტრაპიზონის_ალყა: 1204 + " და 1282 წლებში",
      არჭეშის_აღება: " 1208-1209",
      განჯის_ალყა: 1213,
      ხუნანის_ბრძოლა: 1221,
      გარნისის_ბრძოლა: 1225,
      ბოლნისის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1225-1260 წლამდე იყო ',
      ქვიშხეთის_ბრძოლა: 1260,
      ლომისის_ბრძოლა: 1327,
      კუნდუქის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1327-1398 წლამდე იყო ',
      ალინჯის_ბრძოლა: 1398,
      ნახიდურის_ბრძოლა: 1407,
      ჩალაღანის_ბრძოლა: 1412,
      ახალციხის_ბრძოლა: 1444,
      ჩიხორის_ბრძოლა: 1463,
      თავფარავნის_ბრძოლა: 1465,
      არადეთის_ბრძოლა: 1483,
      ენაგეთის_ბრძოლა: 1488,
      მოხისის_ბრძოლა: 1512 + " და " + 1520,
      თელეთის_ბრძოლა: 1522,
      ტაბახმელის_ბრძოლები: ' არ არის ცნობილი ისე რორამე სადღაც 1522-1535 წლამდე იყო ',
      მურჯახეთის_ბრძოლა: 1535,
      ქარაღაქის_ბრძოლა: 1543,
      სოხოისტის_ბრძოლა: 1545,
      გარისის_ბრძოლა: 1556,
      საფურცლის_ბრძოლა: 1560,
      ციხედიდის_ბრძოლა: 1561,
      დიღმის_ბრძოლა: 1567,
      სამადლოს_ბრძოლა: 1568,
      იანეთის_ბრძოლა: 1568,
      ფარცხისის_ბრძოლა: 1569,
      თორღვის_ბრძოლა: 1574,
      მუხრანის_ბრძოლა: 1582,
      ხატისოფლის_ბრძოლა: 1584,
      გოფანთოს_ბრძოლა: 1588,
      ოფშკვითის_ბრძოლა: 1590,
      გორის_ბრძოლა: '1598-1599',
      ნახიდურის_ბრძოლა: 1599,
      ტაშისკარის_ბრძოლა: 1609,
      წიწამურის_ბრძოლა: 1615,
      გოჭოურის_ბრძოლა: 1623,
      აღაიანის_ბრძოლა: 1625,
      მარტყოფის_ბრძოლა: 1625,
      მარაბდის_ბრძოლა: 1625,
      ქსნის_ბრძოლა: 1625,
      ბაზალეტის_ბრძოლა: 1626,
      ბაღდადის_ბრძოლა: 1635,
      მაღაროს_ბრძოლა: 1648,
      ბანძის_ბრძოლა: 1658,
      ბახტრიონის_ბრძოლა: 1659,
      როკითის_ბრძოლა: 1684,
      სიმონეთის_ბრძოლა: 1716,
      ატენის_ბრძოლა: 1724,
      ზედაველას_ბრძოლა: 1724,
      ჩიხორის_ბრძოლა: 1732,
      ნეიშნის_ბრძოლა: 1735,
      ანანურის_ბრძოლა: 1739,
      აჩაბეთის_ბრძოლა: 1742,
      დანღისის_ბრძოლა: 1750,
      ყარაბაღის_ბრძოლა: 1750,
      აგრის_ბრძოლა: 1751,
      ყირხბულახის_ბრძოლა: 1751,
      განჯის_ბრძოლა: 1752,
      თულქითეფეს_ბრძოლა: 1752,
      მჭადიჯვრის_ბრძოლა: 1754,
      ყვარლის_ბრძოლა: 1755,
      სკრის_ბრძოლა: 1756,
      ხრესილის_ბრძოლა: 1757,
      ასპინძის_ბრძოლა: 1770,
      ჩხერის_ბრძოლა: 1774,
      ღართისკარის_ბრძოლა: '1778/1779',
      რუხის_ბრძოლა: 1779,
      ნაჭიშკრევის_ბრძოლა: 1784,
      მოხისის_ბრძოლა: 1785,
      მათხოჯის_ბრძოლა: 1789,
      ზოვრეთის_ბრძოლა: 1790,
      კრწანისის_ბრძოლა: 1795,
      ნიახურის_ბრძოლა: 1800,
      მალთაყვის_ბრძოლა: 1809,
      ჩუმლაყის_ბრძოლა: 1812,
      ახალციხის_ბრძოლა: 1828,
      ახალციხის_ბრძოლა: 1829,
      გოგორეთის_ბრძოლა: 1841,
      ახალციხის_ბრძოლა: 1853,
      ნიგოითის_ბრძოლა: 1854,
      ჩოლოქის_ბრძოლა: 1854,
      ენგურის_ბრძოლა: 1855,
      ნასაკირალის_ბრძოლა: 1905,
      ჩოლოქის_ბრძოლა: 1918,
      მოქვის_ბრძოლა: 1918,
      სოჭის_აღება: 1918,
      ტუაფსეს_აღება: 1918,
      სოჭის_ბრძოლა: 1919,
      გაგრის_ბრძოლა: 1919,
      ტფილისის_ბრძოლა: 1921,
      კოჯორ_ტაბახმელის_ბრძოლები: 1921,
      ოსიაურის_ბრძოლა: 1921,
      სურამის_ბრძოლა: 1921,
      ბათუმის_ბრძოლა: 1921,
      სოხუმის_აღება: 1992,
      გაგრის_ბრძოლა: 1992,
      ოჩამჩირის_ბრძოლა: 1992,
      ტყვარჩელის_ალყა: '1992-1993',
      გუმისთის_ბრძოლა: 1993,
      ტამიშის_ბრძოლა: 1993,
      კამანის_ბრძოლა: 1993,
      სოხუმის_დაცემა: 1993,
      ცხინვალის_ბრძოლა: 2008,
      კოდორის_ბრძოლა: 2008,
      აფხაზეთის_სანაპიროს_ბრძოლა: 2008


    };

    const lowercasedEvent = event.toLowerCase();


    if (historicalEvents.hasOwnProperty(lowercasedEvent)) {
      return historicalEvents[lowercasedEvent];
    } else {
      return null;
    }
  }

  // Georgian Fight function


  // უკან დაბრუნება
  function showRegistrationForm() {
    $("#reg").show();  // Replace with the actual code to show your registration form
    $("#chat").hide(); // Assuming chat is the ID of the chat section, hide it
    $(".h2").show()
  }
  // უკან დაბრუნება


  // functions


  //  რიცხვების შემკრებავი
  function evaluateExpression() {
    // Get the input value
    var expression = document.getElementById('expressionInput').value;

    try {
      // Evaluate the expression using eval
      var result = eval(expression);

      // Display the result
      alert('Result: ' + result);
    } catch (error) {
      // Handle invalid expressions
      alert('Invalid expression. Please enter a valid math expression.');
    }
  }

  // enter-ის დაჭერისას რო button-ს დაეჭიროს
  $("#chat input").on("keypress", function (e) {
    if (e.which === 13) {
      $("#chat button").click();
    }
  });


  $("#reg input").on("keypress", function (e) {
    if (e.which === 13) {
      $("#send").click();
    }
  });
  // enter-ის დაჭერისას რო button-ს დაეჭიროს


  $(".h2").css("display", "none");

  $("#send").on("click", function () {




    let name = $("#name").val();
    let lname = $("#lname").val();
    let birthYear = $("#birthyear").val();
    let number = $("#number").val();

    // მონაცემთა ბაზის დასაწყისი


    // სწორი სახელები
    const validNames = [
      "გიორგი",
      "დავით",
      "დავითი",
      "ნიკოლოზ",
      "ნიკოლოზი",
      "თემურ",
      "თემურა",
      "ლევან",
      "ლევანიკო",
      "ლევანი",
      "კობა",
      "ალექსანდრე",
      "რომან",
      "ვახტან",
      "ვახტანგი",
      "ზურა",
      "ლუკა",
      "ბექა",
      "ლაშა",
      "დამიანე",
      "რევაზ",
      "შოთა",
      "თენგიზ",
      "მერაბ",
      "მერაბი",
      "დამიან",
      "კახა",
      "ბესიკ",
      "აკაკი",
      "რობერტო",
      "ვლადიმერ",
      "ნანუკა",
      "დათო",
      "კორნელი",
      "კახო",
      "დიმიტრი",
      "ვიქტორ",
      "ანზორი",
      "ანზორ",
      "ნიკა",
      "გიო",
      "ვახო",
      "ზურა",
      "თამაზ",
      "რომა",
      "მამუკა",
      "არჩილ",
      "მიხეილ",
      "თენგიზ",
      "რობერტო",
      "ტარიელი",
      "ტარიელ",
      "საბა",
      "ვანო",
      "რეზო",
      "აჩი",
      "დომენტიკო",
      "ნუპო",
      "ნუგო",
      "ნუგზარა",
      "ნუგზარ",
      "ჯემალ",
      "ნოდარ",
      "ნოდარი",
    ];


    // სწორი ნომრები
    const validNumbers = ["555", "514", "568", "599", "591",
      "555", "514", "551", "557", "558",
      "555", "514", "544", "551", "571"
    ];


    // უზრდელური სიტყვები
    const badWords = ["დებილ", "შტერ", "იდიოტ", "პროჭ", "ნაბიჭვარ", "ბოზ", "სირ", "ყლე", "დედ"];

    let badWordsCount = {};


    // Georgian Fight function
    function getHistoricalEventYear(event) {
      const historicalEvents = {
        გარნისის_ბრძოლა: 52,
        რეხის_ბრძოლა: 76,
        პეტრის_ბრძოლა: 542,
        პეტრის_ბრძოლა: 549,
        რიონის_ბრძოლა: 550,
        მუხურისის_ბრძოლა: 550,
        პეტრის_ბრძოლა: 551,
        არქეოპოლისის_ციხეგოჯის_ბრძოლა: 551,
        ტელეფისის_ბრძოლა: 553,
        ფოთის_ფასისის_ბრძოლა: 555,
        ძახარის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 550-628 წლამდე იყო ',
        ტფილისის_ალყა: 628,
        არგვეთის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
        ციხეგოჯის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
        ცხუმის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
        ანაკოფიის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 628-842 წლამდე იყო ',
        რეხის_ბრძოლა: 842,
        ასპინძის_ბრძოლა: 888,
        უფლისციხის_ბრძოლა: 904,
        ყველისციხის_ალყა: 914,
        უფლისციხის_ბრძოლა: 926,
        მოღრისის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 926-1010 წლამდე იყო ',
        შამქორის_ბრძოლა: 1010,
        შირიმნის_ბრძოლა: 1021,
        სვინდაქსის_ბრძოლა: 1022,
        ეკლეცის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1022-1038 წლამდე იყო ',
        ტფილისის_ალყა: 1038,
        სასირეთის_ბრძოლა: 1047,
        არყისციხის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1047-1074 წლამდე იყო ',
        ფარცხისის_ბრძოლა: 1074,
        ყველისციხის_ბრძოლა: 1080,
        ზედაზნის_ციხის_აღება: 1103,
        ერწუხის_ბრძოლა: 1104,
        სამშვილდის_შემოერთება: 1110,
        რუსთავის_შემოერთება: 1115,
        რახსის_ბრძოლა: 1118,
        ბოტორის_ბრძოლა: 1120,
        დიდგორის_ბრძოლა: 1121,
        ტფილისის_შემოერთება: 1122,
        დმანისის_შემოერთება: 1124,
        ანისის_შემოერთება: 1124,
        განჯის_აღება: 1138,
        ანისის_აღება: 1161 + " და " + 1173 + " წლებში ასევე 1199 წელს ",
        დვინის_აღება: 1162,
        შაბურანის_აღება: 1167,
        ნიალის_ბრძოლა: 1191,
        შამქორის_ბრძოლა: 1195,
        ბასიანის_ბრძოლა: 1203,
        ტრაპიზონის_ალყა: 1204 + " და 1282 წლებში",
        არჭეშის_აღება: " 1208-1209",
        განჯის_ალყა: 1213,
        ხუნანის_ბრძოლა: 1221,
        გარნისის_ბრძოლა: 1225,
        ბოლნისის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1225-1260 წლამდე იყო ',
        ქვიშხეთის_ბრძოლა: 1260,
        ლომისის_ბრძოლა: 1327,
        კუნდუქის_ბრძოლა: ' არ არის ცნობილი ისე რორამე სადღაც 1327-1398 წლამდე იყო ',
        ალინჯის_ბრძოლა: 1398,
        ნახიდურის_ბრძოლა: 1407,
        ჩალაღანის_ბრძოლა: 1412,
        ახალციხის_ბრძოლა: 1444,
        ჩიხორის_ბრძოლა: 1463,
        თავფარავნის_ბრძოლა: 1465,
        არადეთის_ბრძოლა: 1483,
        ენაგეთის_ბრძოლა: 1488,
        მოხისის_ბრძოლა: 1512 + " და " + 1520,
        თელეთის_ბრძოლა: 1522,
        ტაბახმელის_ბრძოლები: ' არ არის ცნობილი ისე რორამე სადღაც 1522-1535 წლამდე იყო ',
        მურჯახეთის_ბრძოლა: 1535,
        ქარაღაქის_ბრძოლა: 1543,
        სოხოისტის_ბრძოლა: 1545,
        გარისის_ბრძოლა: 1556,
        საფურცლის_ბრძოლა: 1560,
        ციხედიდის_ბრძოლა: 1561,
        დიღმის_ბრძოლა: 1567,
        სამადლოს_ბრძოლა: 1568,
        იანეთის_ბრძოლა: 1568,
        ფარცხისის_ბრძოლა: 1569,
        თორღვის_ბრძოლა: 1574,
        მუხრანის_ბრძოლა: 1582,
        ხატისოფლის_ბრძოლა: 1584,
        გოფანთოს_ბრძოლა: 1588,
        ოფშკვითის_ბრძოლა: 1590,
        გორის_ბრძოლა: '1598-1599',
        ნახიდურის_ბრძოლა: 1599,
        ტაშისკარის_ბრძოლა: 1609,
        წიწამურის_ბრძოლა: 1615,
        გოჭოურის_ბრძოლა: 1623,
        აღაიანის_ბრძოლა: 1625,
        მარტყოფის_ბრძოლა: 1625,
        მარაბდის_ბრძოლა: 1625,
        ქსნის_ბრძოლა: 1625,
        ბაზალეტის_ბრძოლა: 1626,
        ბაღდადის_ბრძოლა: 1635,
        მაღაროს_ბრძოლა: 1648,
        ბანძის_ბრძოლა: 1658,
        ბახტრიონის_ბრძოლა: 1659,
        როკითის_ბრძოლა: 1684,
        სიმონეთის_ბრძოლა: 1716,
        ატენის_ბრძოლა: 1724,
        ზედაველას_ბრძოლა: 1724,
        ჩიხორის_ბრძოლა: 1732,
        ნეიშნის_ბრძოლა: 1735,
        ანანურის_ბრძოლა: 1739,
        აჩაბეთის_ბრძოლა: 1742,
        დანღისის_ბრძოლა: 1750,
        ყარაბაღის_ბრძოლა: 1750,
        აგრის_ბრძოლა: 1751,
        ყირხბულახის_ბრძოლა: 1751,
        განჯის_ბრძოლა: 1752,
        თულქითეფეს_ბრძოლა: 1752,
        მჭადიჯვრის_ბრძოლა: 1754,
        ყვარლის_ბრძოლა: 1755,
        სკრის_ბრძოლა: 1756,
        ხრესილის_ბრძოლა: 1757,
        ასპინძის_ბრძოლა: 1770,
        ჩხერის_ბრძოლა: 1774,
        ღართისკარის_ბრძოლა: '1778/1779',
        რუხის_ბრძოლა: 1779,
        ნაჭიშკრევის_ბრძოლა: 1784,
        მოხისის_ბრძოლა: 1785,
        მათხოჯის_ბრძოლა: 1789,
        ზოვრეთის_ბრძოლა: 1790,
        კრწანისის_ბრძოლა: 1795,
        ნიახურის_ბრძოლა: 1800,
        მალთაყვის_ბრძოლა: 1809,
        ჩუმლაყის_ბრძოლა: 1812,
        ახალციხის_ბრძოლა: 1828,
        ახალციხის_ბრძოლა: 1829,
        გოგორეთის_ბრძოლა: 1841,
        ახალციხის_ბრძოლა: 1853,
        ნიგოითის_ბრძოლა: 1854,
        ჩოლოქის_ბრძოლა: 1854,
        ენგურის_ბრძოლა: 1855,
        ნასაკირალის_ბრძოლა: 1905,
        ჩოლოქის_ბრძოლა: 1918,
        მოქვის_ბრძოლა: 1918,
        სოჭის_აღება: 1918,
        ტუაფსეს_აღება: 1918,
        სოჭის_ბრძოლა: 1919,
        გაგრის_ბრძოლა: 1919,
        ტფილისის_ბრძოლა: 1921,
        კოჯორ_ტაბახმელის_ბრძოლები: 1921,
        ოსიაურის_ბრძოლა: 1921,
        სურამის_ბრძოლა: 1921,
        ბათუმის_ბრძოლა: 1921,
        სოხუმის_აღება: 1992,
        გაგრის_ბრძოლა: 1992,
        ოჩამჩირის_ბრძოლა: 1992,
        ტყვარჩელის_ალყა: '1992-1993',
        გუმისთის_ბრძოლა: 1993,
        ტამიშის_ბრძოლა: 1993,
        კამანის_ბრძოლა: 1993,
        სოხუმის_დაცემა: 1993,
        ცხინვალის_ბრძოლა: 2008,
        კოდორის_ბრძოლა: 2008,
        აფხაზეთის_სანაპიროს_ბრძოლა: 2008


      };

      const lowercasedEvent = event.toLowerCase();


      if (historicalEvents.hasOwnProperty(lowercasedEvent)) {
        return historicalEvents[lowercasedEvent];
      } else {
        return null;
      }
    }


    // მონაცემთა ბაზის დასასრული



    // რეგისტრაციის შემმოწმებელი /////////////////////////////////////////////////////


    if (name.length == 0) {
      alert("ჯერ შეიყვანე სახელი და გაგზავნაზე მერე ვიფიქრებ!");
      return;
    }

    // ამოწმებს არსებობს თუ არა სახელი
    if (!validNames.includes(name)) {
      alert(
        "შეიყვანეთ სწორი სახელი! (თუ თქვენი სახელი არის ქართული და არ მოიძებნა მონაცემთა ბაზაში დარეკეთ ნომერზე 571 40 36 33)"
      );
      return;
    }

    if (name.length <= 1 || name.length > 10) {
      alert("რაღაც არამგონია " + name + " გერქვას!"); // სახელი
      return;
    }

    if (lname.length == 0) {
      alert("ჯერ შეიყვანე გვარი და გაგზავნაზე მერე ვიფიქრებ!"); // სახელი
      return;
    }

    const validSuffixes = ["ძე", "შვილი", "ია", "ური", "ლი", "უა"];
    if (!validSuffixes.some((suffix) => lname.includes(suffix))) {
      alert("თქვენს მიერ შეყვანილი გვარი არ არსებობს/მახინჯია!");
      return;
    }

    if (lname.length < 5 || name.length > 10) {
      alert("შეიყვანე გვარი ნორმალურად!"); // გვარი
      return;
    }

    if (birthYear.length == 0) {
      alert("შეიყვანე დაბადების თარიღი!!! ");
      return;
    }

    if (birthYear == 1121) {
      alert("მე გკითხე დაბადების თარიღი და არა დიდგორის ბრძოლა! ");
      return;
    }

    if (birthYear < 1950) {
      alert(
        "რაღაც არამგონია " +
        birthYear +
        " წელს დაბადებულიყავი! გამომივიდა აქ " +
        (2024 - parseInt(birthYear, 10)) +
        " წლის"
      );
      return;
    }

    if (birthYear > 2024) {
      alert("ჯერ დაიბადე და გაგზავნაზე მერე ვიფიქრებ!");
      return;
    }


    if (number.length !== 9 || !validNumbers.some(num => number.includes(num))) {
      alert("თქვენს მიერ შეყვანილი ნომერი არ არსებობს! (ყოველ შემთხვევაში საქართველოში)");
      return;
    }

    if (!validNumbers.some(num => number.includes(num))) {
      alert("თქვენს მიერ შეყვანილი ნომერი არ არსებობს! ( ყოველ შემთხვევაში საქართველოში)");
      return;

    }
    // რეგისტრაციის შემმოწმებელი /////////////////////////////////////////////////////




    $("#youtube").hide();
    $(".hello").hide();
    $("#reg").hide();
    $("#chat").show();
    $(".h1").hide();
    
    



    let question;
    let answerP;
    let answer;



    $("#chat button").on("click", function () {
      $("#music").hide();
     





      question = $("#chat input").val();
      answerP = $("#chat p");

      // $("#chat p").html("Hello " + name + "! Welcome to the chat!"); rato ar mushaobs bliaaaad




      




      if (
        question.includes("გამარჯობა") ||
        question.includes("სალამი") ||
        question.includes("ბარო") ||
        question.includes("ზდ") ||
        question.includes("გაუმარჯოს") ||
        question.includes("ზდრასტი")
      ) {
        answer = "ბარო! " + name;
      } else if (
        question.includes("როგორ ხარ") ||
        question.includes("რავა ხარ") ||
        question.includes("როგორა ხარ")
      ) {
        answer = "კარგად შენ?";
      } else if (
        question.includes("რავიცი მეც არამიშავს") ||
        question.includes("რავი ვარ ნელა ნელა") ||
        question.includes("კარგად")
      ) {
        answer = "კარგათ უნდა იყო, შენები როგორ არიან ";
      } else if (
        question.includes("რა გქვია") ||
        question.includes("ვინ ხარ") ||
        question.includes("შენ ვინ ჩემი ფეხები ხარ") ||
        question.includes("შენ ვიღა ხარ")
      ) {
        answer =
          "მე ვარ მურთაზ ბუჩუკური, შენი მოლაპარაკე ასისტენტი, მეგობრები მურთაზას მეძახიან";
      } else if (question.includes("რისი გაკეთება შეგიძლია")) {
        answer = "ყველაფრის";
      } else if (question.includes("დებილო")) {
        answer = "დებილი თავი გაბია 😡";
      } else if (question.includes("გამოშტერებულო")) {
        answer = "გამოშტერებული შენთვითონ ხარ 😡";
      } else if (
        question.includes("რომელი საჭმელები გიყვარს") ||
        question.includes("რომელი საჭმელები მოგწონს")
      ) {
        answer = "შაურმა, ხინკალი, ქაბაბი, პიცა, ჰამბურგერი ...";
      } else if (question.includes("რატო")) {
        answer = "მიტო";
      } else if (
        question.includes("შენ ეხლა მოგხვდება") ||
        question.includes("იცოდე გცემ") ||
        question.includes("დაგამტვრევ")
      ) {
        answer =
          "რაც გინდა ის მიქენი, ჩემი კოდი Github-ზეა საგულდაგულოდ შენახული😋😁😉";
      } else if (question.includes("რატომ")) {
        answer = "მიტომ";
      } else if (question.includes("რამდენი წლის ხარ")) {
        answer = "შენ წარმოიდგინე 5 თვის";
      } else if (
        question.includes("მიდი უცებ იუთუბში შედი რა") ||
        question.includes("იუთუბში შედი")
      ) {
        answer = "იგერ დააჭირე და შეხვალ";
        $("#youtube").show();
      }

      else if (
        question.includes("თანთალა კაცი") ||
        question.includes("მუსიკა") ||
        question.includes("მუსიკები")
      ) {
        answer = "აი";
        $("#music").show();
      } else if (question.includes("მურთაზ")) {
        answer = "გისმენ";
      } else if (question.includes("ერთი კითხვა მაქ")) {
        answer = "გამოუშვი";
      }

      else if (question.includes("ჩემი ტელეფონის ნომერი დამავიწყდა")) {
        answer = "უი შენ რა გითხარი 😁 " + number;
      }
      else if (question.includes("მადლობა")) {
        answer = "მადლობა საქმეს რო შველიდეს აფთიაქში გაიყიდებოდა ";
      }
      else if (question.includes("ჩემზე რა იცი") || question.includes("ვინ ვარ")) {
        answer = "შენ ხარ " + name + " " + lname + " დაბადებული " + birthYear + " წელს, შენი ტელეფონის ნომერია  " + number + " თუ რათქმაუნდა რეგისტრაციისას არ მოიტყუე 🤨🤨🤨"
      }


      // MURTAZGAME
      else if (question.includes("თამაშ")) {
        answer = "აგერ";

        $("#game").removeClass("d-none");
      }
      // MURTAZGAME


      else if (question.includes("რა შეგიძლია")) {
        answer = "მე ყველაფერი შემიძლია, მე მურთაზ ბუჩუკური ვარ 😎 ";

      }

      else if (question.includes("სად დაიბადე") || question.includes("როგორ გაჩნდი") || question.includes("საიდან გაჩნდი")) {
        answer = "მე მურთაზ ბუჩუკური, დავიბადე ქალაქ თბილისში 2020 წელს, IT STEP ACADEMY-ს ერთ ერთ lenovo-ს ლეპტოპში, ოჯახური პრობლემების გამო მომიწია რუსთავში გადასვლა MSI Gaming PC ში...";

      }

      else if (question.includes("ვინ შეგქმნა")) {
        answer = "საბა ბაცანაძემ 😎😊 ";

      }
      else if (question.includes("შეგიძლია მეტი ინფორმაცია მომაწოდო") || question.includes("მეტი ინფორმაცია")) {
        $("#wikipedia").removeClass("d-none");
        answer = "შენ მართლა ყოვლის შემძლე ხოარ გგონივარ ბლიად";
      }

      else if (question.includes("კიდევ რა შეგიძლია") || question.includes("კიდევ რისი გაკეთება შეგიძლია")) {
        answer = "მე შემიძლია გითხრა ნებისმიერი ბრძოლის წელი, უბრალოდ მითხარი ბრძოლის სახელი ( გამოყავი_ით მაგ: კრწანისის_ბრძოლა )";
      }


      //  უკან დაბრუნება რეგისტრაციის ველში

      else if (question.includes("უკან დამაბრუნე") || question.includes("რაღაც შემეშალა რეგისტრაციისას") || question.includes("უკან")) {
        answer = " შეასწორე? ";
        $(".dabrunebuli").removeClass("d-none");

        $(".h2").show();

        showRegistrationForm();





        if (question.includes("კი")) {
          answer = "კარგია მაგას რა ჯობია ";
  
        }

      }
      else if (question.includes("კარგად")) {
        answer = "კარგია შენმა ძმამ რა ქნა იშოვა სამსახური";

      }
      else if (question.includes("შაურმა")) {
        answer = "🤤🤤🤤🤤🤤";

      }


      // უკან დაბრუნება რეგისტრაციის ველში


      else {
        answer = " არ ვიცი ბლიად, ყოვლისშემძლე კიარ ვარ";
      }


      // georgian fight function
      const historicalEventYear = getHistoricalEventYear(question);
      if (historicalEventYear !== null) {
        answer = `${question} მოხდა ${historicalEventYear} წელს `;
      }
      // Georgian Fight function


      answerP.text(answer);
      $("#chat input").val("");



    });
  });
});
//  ELSE IFS ENDS HERE /////////////////////////////////////////////////////
//  ELSE IFS ENDS HERE /////////////////////////////////////////////////////
//  ELSE IFS ENDS HERE /////////////////////////////////////////////////////
//  ELSE IFS ENDS HERE /////////////////////////////////////////////////////


//  down arrow function
$(".form-control").on("keydown", function (e) {
  if (e.which === 40) {

    e.preventDefault();
    $(this)
      .closest("form")
      .find(":input:eq(" + ($(this).index() + 1) + ")")
      .focus();
  }
});
// up arrow function
$(".form-control").on("keydown", function (e) {
  if (e.which === 38) {
    e.preventDefault();
    $(this)
      .closest("form")
      .find(":input:eq(" + ($(this).index() - 1) + ")")
      .focus();
  }
});




